# Taps
tap 'github/gh'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'shivammathur/php'
tap "universal-ctags/universal-ctags"

# Formulae
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'deno'
brew 'dnsmasq'
brew 'emojify'
brew 'gh'
brew 'git'
brew 'go'
brew 'grep'
brew 'hub'
brew 'imagemagick'
brew 'make'
brew 'mas' # Mac App Store command-line interface
# brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'openssl'
#
brew 'php'
brew 'shivammathur/php/php@7.4'
#
# brew 'postgresql'
# @todo(psql) upgrade path
brew 'postgresql@9.4'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'rustup-init'
brew 'svn' # for fonts
brew 'tmux'
brew "universal-ctags", args: ["HEAD"]
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'wp-cli'
brew 'wxwidgets'
brew 'xcodegen'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Python Specific
# brew 'fonttools' # python3 -m pip install fonttools
# brew 'brotli' # python3 -m pip install brotli

# Casks
cask '1password'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'bartender'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'encryptme'
cask 'fantastical'
# cask 'figma'
cask 'firefox'
cask 'fliqlo'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hyper'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
# cask 'kaleidoscope'
cask 'keka'
cask 'kid3'
cask 'little-snitch'
# cask 'loom'
cask 'micro-snitch'
# cask 'microsoft-auto-update'
# cask 'microsoft-edge'
# cask 'microsoft-outlook'
# cask 'microsoft-teams'
# cask 'minecraft'
# cask 'monitorcontrol'
cask 'ngrok'
cask 'notion'
cask 'now'
cask 'plex'
cask 'plex-media-server'
cask 'postman'
cask 'proxyman'
cask 'raycast'
# cask 'react-native-debugger'
cask 'robo-3t'
cask 'sequel-pro'
# cask 'signal'
cask 'simple-comic'
cask 'sketch'
cask 'slack'
# cask 'sonos'
cask 'spotify'
cask 'tableplus'
cask 'tower'
cask 'transmission'
cask 'transmission-remote-gui'
cask 'transmit'
# cask 'twitch'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'zeplin'
cask 'zoom'

# Rouge Amoeba
cask 'airfoil'
cask 'audio-hijack'
cask 'farrago'
cask 'fission'
cask 'loopback'

# Fonts
cask 'font-barlow'
cask 'font-fira-code'
cask 'font-ibm-plex'
cask 'font-inter'
cask 'font-roboto-mono'
cask 'font-roboto'

# Mac App Store Applications
mas '1Blocker', id: 1365531024
# mas 'GarageBand', id: 682658836
# mas 'GIF Brewery 3', id: 1081413713
mas 'Gifski', id: 1351639930
# mas 'iMovie', id: 408981434
mas 'Jiffy', id: 1502527999
# mas 'Keynote', id: 409183694
# mas 'LINE', id: 539883307
# mas 'Microsoft Excel', id: 462058435
# mas 'Microsoft Word', id: 462054704
mas 'Noizio', id: 928871589
# mas 'Numbers', id: 409203825
# mas 'Pages', id: 409201541
mas 'Pandan', id: 1569600264
# mas 'Quiplash', id: 1002623276
mas 'Solitaire+', id: 515113678
# mas 'The Jackbox Party Pack 5', id: 1438912153
mas 'UTC Time', id: 1538245904
# mas 'Xcode', id: 497799835 # note(xcode) need to uninstall/install from brew
