# Taps
tap 'github/gh'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap "universal-ctags/universal-ctags"

# Formulae
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'gh'
brew 'git'
brew 'git-filter-repo'
brew 'go'
brew 'grep'
brew 'hub'
brew 'imagemagick'
brew 'jsonnet'
brew 'make'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'pnpm'
brew 'pyenv'
brew 'rbenv'
brew 'svn' # for fonts
brew 'tmux'
brew "universal-ctags", args: ["HEAD"]
brew 'vim'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Casks
cask '1password'
# cask 'bartender'
cask 'figma'
cask 'hyper'
cask 'iterm2'
cask 'notunes'
cask 'podman'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

# Fonts
cask 'font-ibm-plex'
cask 'font-inter'
cask 'font-roboto-mono'
cask 'font-roboto'
